output: default
streamtags:
  - OCSF
groups:
  ejqL2X:
    name: "Normalize only Conn log-type data for the OCSF "
    description: "for syslog log-format, extract syslog message to top level and
      remove extraneous nested fields. "
    index: 0
    disabled: false
  P8NU23:
    name: Metadata
    description: Metadata fields
    disabled: false
    index: 1
  Jf2DHE:
    name: Base Fields
    description: "Rename fields that map to schema and restructure data for parquet. "
    index: 2
    disabled: false
  mcwdMM:
    name: Format
    description: Prepare data to be converted according to OCSF Scheema
    disabled: false
    index: 3
  q1dhTd:
    name: Calculated Fields
    description: Functions to process calculated fields for OCSF
    index: 4
    disabled: false
asyncFuncTimeout: 1000
functions:
  - id: eval
    filter: "true"
    disabled: false
    conf:
      add:
        - disabled: false
          name: log_format
          value: >
            _raw.match(/.*\t/) ? 'TSV' : (_path ? 'json' :
            (JSON.parse(_raw)["@path"] ? 'elastic' : (_raw.match(/<\d+>/) ?
            'syslog' : 'general')))
      keep:
        - "*"
    description: "Creates an internal field identifier for the log format coming
      through (tsv, csv, json, elastic, etc.) "
    groupId: ejqL2X
  - id: serde
    filter: log_format == 'syslog'
    disabled: false
    conf:
      mode: extract
      type: json
      srcField: message
      cleanFields: true
      allowedKeyChars: []
      allowedValueChars: []
      keep: []
      remove:
        - message
    description: Keep this function enabled
    final: false
    groupId: ejqL2X
  - id: serde
    filter: log_format == 'TSV'
    disabled: false
    conf:
      mode: extract
      type: delim
      delimChar: \t
      quoteChar: '"'
      escapeChar: \
      nullValue: "-"
      srcField: _raw
      fields:
        - ts
        - uid
        - id_orig_h
        - id_orig_p
        - id_resp_h
        - id_resp_p
        - proto
        - service
        - duration
        - orig_bytes
        - resp_bytes
        - conn_state
        - local_orig
        - missed_bytes
        - history
        - orig_pkts
        - orig_ip_bytes
        - resp_pkts
        - resp_ip_bytes
        - tunnel_parents
    description: Optional - This parser function depends on how TSV headers are
      being sent from the Sensor. Validate the types and fields order to add,
      remove or reorder the fields in the current parser (CL_Conn)
    groupId: ejqL2X
  - id: drop
    filter: "!_path.startsWith('conn') && !__e['@path'].startsWith('conn') &&
      !sourcetype.includes('conn')"
    disabled: false
    conf: {}
    description: Drops events that are NOT of the conn log-type
    groupId: ejqL2X
  - id: drop
    filter: _path.includes('_red') || __e['@path'].startsWith('_red') ||
      sourcetype.match(/_red/)
    disabled: false
    conf: {}
    groupId: ejqL2X
  - id: eval
    filter: "true"
    disabled: false
    conf:
      remove:
        - _raw
        - message
    groupId: ejqL2X
  - id: comment
    filter: "true"
    disabled: false
    conf:
      comment: Metadata Fields
    groupId: P8NU23
  - id: eval
    filter: "true"
    disabled: false
    conf:
      add:
        - disabled: false
          name: connection_info__direction_id
          value: "0"
        - disabled: false
          name: metadata__version
          value: '"1.0.0"'
        - disabled: false
          name: metadata__product__name
          value: '"Corelight"'
        - disabled: false
          name: metadata__product__vendor_name
          value: '"Corelight"'
    description: Metadata fields
    groupId: P8NU23
  - id: rename
    filter: "true"
    disabled: false
    conf:
      wildcardDepth: 5
      rename:
        - currentName: "'id.resp_h'"
          newName: dst_endpoint__ip
        - currentName: "'id.resp_p'"
          newName: dst_endpoint__port
        - currentName: "'id.orig_h'"
          newName: src_endpoint__ip
        - currentName: "'id.orig_p'"
          newName: src_endpoint__port
        - currentName: action
          newName: activity_name
        - currentName: proto
          newName: connection_info__protocol_name
        - currentName: rulelabel
          newName: dst_endpoint__svc_name
        - currentName: inbytes
          newName: traffic.bytes_in
        - currentName: outbytes
          newName: traffic.bytes_out
        - currentName: _raw
          newName: raw_data
        - currentName: datetime
          newName: metadata__original_time
        - currentName: service
          newName: appname
    groupId: Jf2DHE
  - id: comment
    filter: "true"
    disabled: false
    conf:
      comment: Activity ID, Activity Name, Status ID and Status field correlation
        based on Corelight data
    groupId: Jf2DHE
  - id: lookup
    filter: "true"
    disabled: false
    conf:
      matchMode: exact
      reloadPeriodSec: -1
      addToEvent: false
      inFields:
        - eventField: conn_state
          lookupField: code
      ignoreCase: false
      matchType: first
      file: corelight_conn_state.csv
      outFields:
        - lookupField: activity_id
          eventField: activity_id
        - lookupField: activity_name
          eventField: activity_name
        - lookupField: status_id
          eventField: status_id
        - lookupField: status
          eventField: status
    groupId: Jf2DHE
    description: Lookup function matches the relevant conn_state in the event and
      correlates with the OCSF Schema
  - id: comment
    filter: "true"
    disabled: false
    conf:
      comment: Severity ID
    groupId: Jf2DHE
  - id: eval
    filter: "true"
    disabled: false
    conf:
      add:
        - disabled: false
          name: severity_id
          value: "99"
        - disabled: false
          name: severity_id
          value: "severity == 'Unknown' ? 0 : severity_id"
        - disabled: false
          name: severity_id
          value: "severity == 'Informational' ? 1 : severity_id"
        - disabled: false
          name: severity_id
          value: "severity == 'Low' ? 2 : severity_id"
        - disabled: false
          name: severity_id
          value: "severity == 'Medium' ? 3 : severity_id"
        - disabled: false
          name: severity_id
          value: "severity == 'High' ? 4 : severity_id"
        - disabled: false
          name: severity_id
          value: "severity == 'Critical' ? 5 : severity_id"
        - disabled: false
          value: "severity == 'Fatal' ? 6 : severity_id"
          name: severity_id
    description: severity_id
    final: false
    groupId: Jf2DHE
  - id: comment
    filter: "true"
    disabled: false
    conf:
      comment: Status ID, Status & Status Code fields
    groupId: Jf2DHE
  - id: eval
    filter: "true"
    disabled: false
    conf:
      add:
        - disabled: false
          name: status_code
          value: conn_state
    description: status_code
    groupId: Jf2DHE
  - id: numerify
    filter: "true"
    disabled: false
    conf:
      format: none
      ignoreFields:
        - status
        - status_code
      filterExpr: ""
      digits: 0
    groupId: Jf2DHE
  - id: serialize
    filter: "true"
    disabled: false
    conf:
      type: json
      dstField: __tmp
      fields:
        - "!_*"
        - "!cribl_*"
        - "*"
    description: Push to internal __tmp field
    groupId: mcwdMM
  - id: code
    filter: "true"
    disabled: false
    conf:
      maxNumOfIterations: 5000
      code: |-
        function convertToNestedJSON(jsonString) {
          const jsonObj = JSON.parse(jsonString);
          const nestedObj = {};

          for (let key in jsonObj) {
            const nestedKeys = key.split('__');
            let currentObj = nestedObj;

            for (let i = 0; i < nestedKeys.length - 1; i++) {
              const nestedKey = nestedKeys[i];

              if (!(nestedKey in currentObj)) {
                currentObj[nestedKey] = {};
              }

              currentObj = currentObj[nestedKey];
            }

            currentObj[nestedKeys[nestedKeys.length - 1]] = jsonObj[key];
          }

          return JSON.stringify(nestedObj);

        }

        __e._tmp = convertToNestedJSON(__e.__tmp)
    description: Convert to nested JSON string
    groupId: mcwdMM
  - id: serde
    filter: "true"
    disabled: false
    conf:
      mode: extract
      type: json
      srcField: _tmp
    description: Parse all the fields to top
    groupId: mcwdMM
  - id: eval
    filter: duration==undefined && start_time!=undefined && end_time!=undefined
    disabled: false
    conf:
      add:
        - name: duration
          value: " end_time - start_time"
    description: Calculate duration field if not mapped
    groupId: q1dhTd
  - id: eval
    filter: "true"
    disabled: false
    conf:
      add:
        - name: activity_id
          value: activity_id
        - name: severity
          value: "cisco_severity == 0 ? \"Critical\" : cisco_severity == 1 ? 'Critical' :
            cisco_severity == 2 ? 'High' : cisco_severity == 3 ? 'Fatal' :
            cisco_severity == 4 ? \"Medium\" : cisco_severity == 5 ?\" Low\" :
            cisco_severity == 6 ? \"Information\" : cisco_severity == 7 ?
            \"Unknown\" : \"Unknown\"

            \ "
          disabled: true
        - name: status_id
          value: "0"
          disabled: true
        - name: status_code
          value: "''"
          disabled: true
        - name: status_detail
          value: "''"
          disabled: true
        - disabled: false
          name: activity
          value: activity_name
      remove: []
    description: "EDIT ME: Classification fields. Needs custom adjustments based on
      the Security posture in the environment"
    groupId: q1dhTd
  - id: serialize
    filter: "true"
    disabled: false
    conf:
      type: json
      dstField: unmapped
      fields:
        - _path
        - _time
        - community_id
        - conn_state
        - corelight_shunted
        - cribl_pipe
        - facility
        - facilityName
        - history
        - host
        - id.resp_h_name.src
        - local_orig
        - local_resp
        - missed_bytes
        - orig_bytes
        - orig_ip_bytes
        - orig_l2_addr
        - orig_pkts
        - procid
        - resp_bytes
        - resp_ip_bytes
        - resp_l2_addr
        - resp_pkts
        - spcap.rule
        - spcap.trigger
        - spcap.url
        - ts
        - uid
        - corelight_logs
        - history_description
        - index
        - sourcetype
    groupId: q1dhTd
  - id: eval
    filter: "true"
    disabled: false
    conf:
      add:
        - name: activity_id
          value: "0"
          disabled: true
        - name: severity_id
          value: "0"
          disabled: true
        - disabled: true
          name: status
          value: "status_id=='99' ? 'Other' : status || status_id=='0' ? 'Unknown' :
            status || status_id=='1' ? 'Success' : status || status_id=='2' ?
            'Failure' : status"
        - name: category_name
          value: "'Network Activity'"
        - name: category_uid
          value: "4"
        - name: class_name
          value: "'Network Activity'"
        - name: class_uid
          value: "4001"
        - name: type_uid
          value: class_uid * 100 + activity_id
        - name: type_name
          value: "class_name + ': ' + activity"
        - name: time
          value: _time
        - name: raw_data
          value: _raw
          disabled: false
        - name: app_name
          value: service
        - name: count
          value: repeat_count
      remove:
        - _raw
        - cribl_*
        - repeat_count
        - "*__*"
        - _time
    description: "Mapping for classification and context fields "
    groupId: q1dhTd
  - id: comment
    filter: "true"
    disabled: false
    conf:
      comment: This is the final cleanup step. We are going to keep only fields that
        are within the
        https://schema.ocsf.io/classes/network_activity?extensions= spec and
        remove all others.
    groupId: q1dhTd
  - id: eval
    filter: "true"
    disabled: false
    conf:
      remove:
        - "*"
      keep:
        - activity_name
        - activity_id
        - app_name
        - category_name
        - category_uid
        - class_name
        - class_uid
        - confidence
        - connection_info
        - count
        - data
        - dst_endpoint
        - duration
        - end_time
        - enrichments
        - time
        - message
        - metadata
        - observables
        - proxy
        - raw_data
        - severity
        - severity_id
        - src_endpoint
        - start_time
        - status
        - status_code
        - status_detail
        - status_id
        - tls
        - timezone_offset
        - traffic
        - type_uid
        - type_name
        - mapped
        - connection_info.boundary
        - connection_info.boundary_id
        - connection_info.uid
        - connection_info.direction
        - connection_info.direction_id
        - connection_info.protocol_ver
        - connection_info.protocol_ver_id
        - connection_info.protocol_name
        - connection_info.protocol_num
        - connection_info.tcp_flags
        - dst_endpoint.location
        - dst_endpoint.domain
        - dst_endpoint.hostname
        - dst_endpoint.ip
        - dst_endpoint.instance_uid
        - dst_endpoint.intermediate_ips
        - dst_endpoint.mac
        - dst_endpoint.name
        - dst_endpoint.interface_uid
        - dst_endpoint.interface_name
        - dst_endpoint.port
        - dst_endpoint.svc_name
        - dst_endpoint.subnet_uid
        - dst_endpoint.uid
        - dst_endpoint.vlan_uid
        - dst_endpoint.vpc_uid
        - traffic.bytes_in
        - traffic.bytes_out
        - traffic.packets_in
        - traffic.packets_out
        - traffic.bytes
        - traffic.packets
        - src_endpoint.location
        - src_endpoint.domain
        - src_endpoint.hostname
        - src_endpoint.ip
        - src_endpoint.instance_uid
        - src_endpoint.intermediate_ips
        - src_endpoint.mac
        - src_endpoint.name
        - src_endpoint.interface_uid
        - src_endpoint.interface_name
        - src_endpoint.port
        - src_endpoint.svc_name
        - src_endpoint.subnet_uid
        - src_endpoint.uid
        - rc_endpoint.vlan_uid
        - src_endpoint.vpc_uid
        - metadata.correlation_uid
        - metadata.uid
        - metadata.labels
        - metadata.logged_time
        - metadata.modified_time
        - metadata.original_time
        - metadata.processed_time
        - metadata.product
        - metadata.profiles
        - metadata.sequence
        - metadata.version
        - metadata.product.feature
        - metadata.product.lang
        - metadata.product.uid
        - metadata.product.name
        - metadata.product.path
        - metadata.product.version
        - metadata.product.vendor_name
        - metadata.product.feature.uid
        - metadata.product.feature.name
        - metadata.product.feature.version
        - connection_info.protocol
        - unmapped.*
        - unmapped
    description: Network Activity Class fields only
    groupId: q1dhTd
  - id: numerify
    filter: "true"
    disabled: false
    conf:
      format: none
      ignoreFields:
        - status_detail
        - status_code
        - status
      filterExpr: ""
      digits: 0
    groupId: q1dhTd
description: "Maps ZScaler firewall events to the following schema:
  https://schema.ocsf.io/classes/network_activity?extensions="
